Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/law_enforcement/restriction_on_movement_orders.html.txt.tmx
Source language: en
Languages: ga

source: As an alternative to imposing a custodial sentence, the courts can impose restrictions on the movements of those convicted of some minor offences
ga: Mar mhalairt ar phianbhreith choimeádta a ghearradh, is féidir leis na cúirteanna srianta a ghearradh ar ghluaiseachtaí daoine a ciontaíodh as roinnt mionchionta

source: These restrictions are known as restriction on movement orders and were introduced under Section 101 of the Criminal Justice Act 2006
ga: Tugtar orduithe srianta gluaiseachta ar na srianta seo agus tugadh isteach iad faoi Alt 101 den Acht um Cheartas Coiriúil 2006

source: A restriction on movement order only applies where someone aged 18 years or over has been convicted by the court and sentenced to a term of imprisonment of 3 months or more
ga: Ní bhíonn ordú srianta gluaiseachta i bhfeidhm ach nuair a ciontaíonn an chúirt duine éigin darb aois 18 mbliana nó níos mó agus nuair a ghearrtar téarma príosúnachta orthu de 3 mhí nó níos mó

source: The court cannot impose a restriction on movement order for a period longer than 6 months
ga: Ní féidir leis an gcúirt ordú srianta gluaiseachta a ghearradh ar feadh tréimhse níos faide ná 6 mhí

source: What restrictions can the order impose on me?
ga: Cén srianta ar féidir leis an ordú a ghearradh orm?

source: The order can restrict your movements as the court considers appropriate and may include a curfew element
ga: Is féidir leis an ordú do ghluaiseachtaí a shrianadh de réir mar a mheasann an chúirt atá cuí agus b’fhéidir go mbeadh cuirfiú mar chuid de

source: This would oblige you to be in a particular place for a particular period
ga: Chuirfeadh sé seo oibleagáid ort a bheith in áit ar leith ar feadh tréimhse áirithe

source: For example, you may be required to be at your home between the hours of 8pm and 8am
ga: Mar shampla, bheadh ort bheith i do theach idir uaireanta 8i.n. agus 8 r.n

source: Similarly, the order could include a prohibition forbidding you from being in a particular place for a particular period
ga: Ar an dóigh chéanna, d’fhéadfadh an t-ordú toirmeasc a chur ort bheith in áit áirithe ar feadh tréimhse áirithe

source: For example, you may be required to stay away from a certain named street or premises between 8pm and 8am
ga: Mar shampla, b’fhéidir go mbeadh ort fanacht ar shiúl ó shráid nó áitreabh ainmnithe áirithe idir 8i.n. agus 8r.n

source: An order cannot require you to remain in a place or places for more than 12 hours in a day
ga: Ní féidir le hordú iallach a chur ort fanacht in áit nó in áiteanna ar feadh tréimhse níos mó ná 12 uaire in aon lá amháin

source: The court arranges for a copy of the restriction on movement order to be sent to the Garda station which looks after the area where the offender resides
ga: Socraíonn an chúirt go gcuirfí cóip den ordú srianta gluaiseachta chuig stáisiún na nGardaí a bhfuil freagracht aige as an gceantar a bhfuil an ciontóir ina chónaí ann

source: Can orders be changed or varied after they are made?
ga: An féidir orduithe a athrú tar éis a ndéanta?

source: A court may vary an order on the written application of the following people:
ga: Is féidir le cúirt ordú a athrú ar iarratas scríofa a fháil ó dhuine de na daoine seo a leanas:

source: • The owner of the premises specified in the order
ga: • Úinéir an áitribh atá sainráite san ordú

source: • An adult normally resident at the premises specified in the order
ga: • Duine fásta ar ghnáth-áit chónaithe dó an t-áitreabh atá sainráite san ordú

source: • A member of the Garda Síochána
ga: • Ball den Gharda Síochána

source: The court may vary the order by substituting another place or period of time for the place or time already specified in the order
ga: Is féidir leis an gcúirt an t-ordú a athrú trí áit nó tréimhse ama eile a chur isteach in áit na háite nó na tréimhse atá sainráite san ordú cheana féin

source: Can I have more than one restriction on movement order placed on me?
ga: An féidir leis na cúirteanna níos mó ná aon ordú srianta gluaiseachta a chur orm?

source: Where more than one order is in place, however, the period of time that you are required to remain at a place or places cannot exceed 6 months
ga: Nuair a bhíonn níos mó ná aon ordú in áit, áfach, ní féidir leis an dtréimhse ama is gá duit fanacht in áit nó in áiteanna dul thar 6 mhí

source: Where orders are imposed for two or more offences they may be concurrent – that is, they run at the same time – or they may be consecutive – that is, the second order will only begin when the first order finishes
ga: Nuair a ghearrtar orduithe as dhá chion nó níos mó is féidir leo a bheith comhthráthach – is é sin, is féidir leo rith ag an am céanna – nó is féidir leo a bheith comhleantach – is é sin, ní thosóidh an dara hordú go dtí go gcríochnóidh an chéad ordú

source: In either event the total period of time that you are required to remain at a place or places cannot exceed a maximum of 6 months
ga: I gceachtar den dá chás, ní bheidh an tréimhse ama a gcaithfidh tú fanacht in aon áit nó in áiteanna a bheith níos mó ná uasmhéid de 6 mhí

source: What happens if I fail to comply with the order?
ga: Cad a tharlóidh mura gcomhlíonfaidh mé an t-ordú?

source: As the Gardai in your area receive a copy of your order from the court, they have responsibility for ensuring you comply with it
ga: Nuair a fhaigheann na Gardaí i do cheantar cóip den ordú ón gcúirt, beidh siad freagrach as a chinntiú go gcomhlíonann tú é

source: If the Gardai are of the opinion that you have breached the order they can go back to the court and let the court know
ga: Má tá na Gardaí den bharúil gur sháraigh tú an t-ordú is féidir leo dul ar ais chun na cúirte agus é sin a a chur in iúl don chúirt

source: If the court considers that you have breached the order the court can do any of the following:
ga: Má mheasann an chúirt gur sháraigh tú an t-ordú is féidir leis an gcúirt aon cheann de na rudaí seo a leanas a dhéanamh:

source: • Direct you to comply with the order
ga: • Tú a threorú leis an ordú a chomhlíonadh

source: • Cancel the order and impose another restriction on movement order on you
ga: • An t-ordú a chur ar ceal agus ordú eile srianta gluaiseachta a ghearradh ort

source: • Cancel the order and deal with your case in whatever other way it could have been dealt with before the order was made
ga: • An t-ordú a chealú agus déileáil le do chás ar cibé dóigh eile a d’fhéadfaí déileáil leis sula ndearnadh an t-ordú

source: In reality this means that the court has the power to re-activate or to impose the original prison sentence and send you to jail, if you fail to obey the restriction of movement order
ga: Is féidir orduithe srianta gluaiseachta a ghearradh ar dhaoine as na cionta seo a leanas faoin Cacht um Cheartas Coiriúil (Ord Poiblí) 1994 agus faoin Acht um Chionta Neamh-Mharfacha In Aghaidh an Duine 1997:

source: What are the offences for which a restriction of movement order can be imposed?
ga: • Alt 8: (mainneachtain ordachán ó Chomhalta den Gharda Síochána a chomhlíonadh)
